11/data/attachments/ec867675b131faa0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_4a30ecd8-5f2c-444f-848c-1a470a06c87e</nif:username>
            <nif:friendToBeAdded>Steven_sister_Friend_11980_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>